{
  "basics": {
    "name": "Léon Mangeat",
    "label": "Développeur web Fullstack / Expert Angular",
    "image": "",
    "email": "leon.mangeat@gmail.com",
    "phone": "+33 7 86 85 87 27",
    "summary": "Développeur web depuis plus de 9 ans, j’ai d’abord commencé mon expérience professionnelle en Java puis ai rapidement intégré Angular dans mes développements. Tombé amoureux du framework et plus globalement de JavaScript/Typscript, j’en ai fait mon cœur de maitrise et suis devenu, au fil des années, expert Angular.\nEn CDI tout le début de ma carrière je me suis lancé depuis l'an dernier en freelance.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Lyon",
      "countryCode": ""
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Léon Mangeat",
        "url": "https://fr.linkedin.com/in/l%C3%A9on-mangeat-112a02128"
      }
    ]
  },
  "work": [
    {
      "name": "Jacquet Metals",
      "position": "Lead technique frontend",
      "summary": "But fonctionnel : Conception et réalisation d’une application WEB interne à destination des commerciaux de l'entreprise. Elle s’inscrit en tant que module partiel dans un projet de remplacement global de l’ERP “maison” et joue le rôle d’application pilote pour refondre l’intégralité de celui-ci par la suite.\nIl s’agit du module de création de devis réalisés par les commerciaux de l’entreprise. Un besoin de performance, d’ergonomie et de modernisation couplé à un respect des habitudes des utilisateurs, travaillant pour certains depuis plusieurs dizaines d’années sur l’ancien outil, est donc central au développement de ce projet.\nMon rôle sur le projet : J’arrive sur le projet après environ un an d'existence avec un besoin d’expertise technique sur le framework Angular (et les technologies front en général). J'interviens donc en tant que lead technique sur la partie frontend avec pour but de mettre en place des bonnes pratiques, une structure et un cadre manquant sur celle-ci.\nJ’ai aussi une position plus transverse de référent technique front et Angular sur l’ensemble du pôle “digital”.\n",
      "url": "https://www.jacquetmetals.com/",
      "startDate": "2024-02",
      "endDate": "Aujourd'hui",
      "highlights": [
        "Equipe : 1 Tech lead back (et team lead), 2 développeurs backend, 1 tech lead frontend, 1 à 2 développeur frontend, 2 PO",
        "Participation aux ateliers de mûrissement des besoins fonctionnels",
        "Conception et réalisation de fonctionnalités en Angular",
        "Mise en place de bonnes pratiques",
        "Mise en place de l’architecture applicative front, respectant les principes de la Clean Architecture et d’une arborescence liée",
        "Mise en place d’un mécanisme de sauvegarde automatique. Refondu par la suite pour implémenter la RFC 6902 - JSON patch",
        "Menée de la montée en compétences des autres développeurs et nouveaux arrivants",
        "Mise en place et évolution d’un store redux avec NGRX",
        "Décentralisation, atomisation et découplage de la logique applicative en différentes librairies Angular",
        "Optimisation des applications front et back (NgZone, change detection, Angular resolvers, caching)",
        "Maintien des versions des librairies utilisées sur les dernières version LTS",
        "Développement de tests unitaires",
        "Relecture de code des pairs",
        "Ecriture de documentations",
        "Participation aux cérémonies (et ateliers) agiles",
        "Technologies utilisées : Angular · REST · NGRX · PrimeNG",
        "CI/CD : GitLab CI/CI · Docker · Kubernetes"
      ]
    },
    {
      "name": "Astek pour le client Orange",
      "position": "Développeur Full Stack expérimenté",
      "summary": "But fonctionnel : Conception et réalisation d’une application WEB B2B à destination des opérateurs techniques fibre. Le projet a pour but de venir remplacer un ensemble de plusieurs applications de gestion et prise de commandes pour n'en faire qu'une seule, afin de simplifier le parcours et donc l’expérience utilisateur.\nLes processus de gestion de commande sont basés sur une norme universelle propre au secteur de la télécommunication.\nRôle de mon équipe : Conception et réalisation du portail front office. Le but étant de fédérer un ensemble de micro-services via une application dite \"back for front\" et de proposer une application front proposant les fonctionnalités de prise et gestion de commandes.",
      "url": "https://astekgroup.fr/",
      "startDate": "2021-03",
      "endDate": "2023-07",
      "highlights": [
        "Projet agile multi-team, 7 équipes SCRUM de 5 personnes en moyenne",
        "Taille de mon équipe : 1 Tech lead, 5 développeurs, 2 PO/Proxy PO",
        "Participation aux ateliers de mûrissement de l’architecture technique",
        "Conception et réalisation de fonctionnalités en Angular et NestJS",
        "Création d’endpoint GraphQL agrégeant les données des API de nos partenaires",
        "Création d’écrans pilotés par des processus métier back",
        "Mise en place et évolution d’un store front avec Apollo",
        "Réalisation de l’architecture applicative, back et front, respectant les principes de la Clean Architecture",
        "Décentralisation de la logique applicative en différentes librairies Angular, NestJS et Typescript",
        "Réalisation d’un design-system",
        "Optimisation des applications front et back (NgZone, change detection, feature module, resolve fields, Angular resolvers, caching)",
        "Développement de tests unitaires",
        "Relecture de code des pairs",
        "Ecriture de documentations",
        "Participation aux cérémonies (et ateliers) agiles SCRUM",
        "Montée en compétences de nouveaux arrivants",
        "Technologies utilisées : Angular · NestJS · GraphQL · Nx · Apollo Angular",
        "CI/CD : GitLab CI/CI · Sonar · Docker · Kubernetes"
      ]
    },
    {
      "name": "Astek pour le client Interpol",
      "position": "Développeur Full Stack",
      "summary": "Conception et réalisation d’une application web à destination des agents d’Interpol et des différents postes de police dans le monde. Le projet a pour but de gérer les œuvres d’arts volées, référencées par Interpol. Refonte complète, en repartant de zéro, d’un outil existant mais présentant un certain nombre de freins pour ces utilisateurs car pas complétement adapté à leurs besoins.",
      "url": "https://astekgroup.fr/",
      "startDate": "2018",
      "endDate": "2021-03",
      "highlights": [
        "Equipe : Entre 2 et 5 membres, méthodologie agile (SCRUM)",
        "Développements full stack des features demandées",
        "Conception de solutions techniques (seul ou en atelier, projet créé de zéro)",
        "Accompagnement et soutien technique des autres développeurs",
        "Montée en compétences de nouveaux arrivants",
        "Mise en place des environnements de déploiements (Dev, intégration, recette client)",
        "Participation aux campagnes de tests",
        "Mise en place de tests et déploiements automatisés (GitLab CI/CD)",
        "Participation aux cérémonies (et ateliers) agiles SCRUM",
        "Utilisation de Gateling pour effectuer des tests de performances",
        "Lead technique sur la dernière année de mon intervention sur le projet",
        "Technologies utilisées : Angular · Spring Boot · MongoDB · ElasticSearch · Spring Data · MariaDB",
        "CI/CD : GitLab CI/CI · Sonar"
      ]
    },
    {
      "name": "Astek pour le client Interpol",
      "position": "Développeur Full Stack",
      "summary": "Conception et réalisation d’un web service REST à destination du site web publique d’Interpol. Le projet a pour but de référencer les personnes disparues et les criminels recherchés à l’international. Cette API est principalement utilisée pour le site web d’Interpol (Notices rouge, Notices jaunes, Notices CSNU) mais a aussi pour but de pouvoir être utilisée librement, en lecture, par toute personne qui le souhaite.",
      "url": "https://astekgroup.fr/",
      "startDate": "2017",
      "endDate": "2021",
      "highlights": [
        "Equipe : Entre 2 et 3 membres",
        "Développement des fonctionnalités et mise en place des solutions techniques",
        "Développement de tests unitaires",
        "Conception de solutions techniques (seul ou en atelier, projet créé de zéro)",
        "Mise en place des environnements de déploiements (Dev, intégration, recette client, production)",
        "Mise en place des déploiements automatisés (Jenkins)",
        "Ecriture de documentations",
        "Participation aux campagnes de tests",
        "Accompagnement et soutien technique des autres développeurs",
        "Montée en compétences de nouveaux arrivants",
        "Analyse et rédaction de chiffrages pour le client",
        "Technologies utilisées : Mongoose ODM · PM2 · Node.js · MongoDB",
        "CI/CD : GitLab CI/CI · Sonar"
      ]
    },
    {
      "name": "Astek pour le client Fedex",
      "position": "Développeur Full Stack",
      "summary": "Développement d’une application web auto-suffisante avec installeur. Le projet a pour but la gestion des colis et l’impression d’étiquettes d’expédition. L’outil est à destination des clients professionnels de Fedex souhaitant expédier régulièrement des colis.",
      "url": "https://astekgroup.fr/",
      "startDate": "2017",
      "endDate": "2018",
      "highlights": [
        "Equipe : Entre 2 et 3 membres",
        "Développement des fonctionnalités et mise en place des solutions techniques",
        "Développement de tests unitaires",
        "Participation aux campagnes de tests",
        "Analyse et rédaction de chiffrages pour le client",
        "Technologies utilisées : AngularJS · Spring"
      ]
    },
    {
      "name": "Astek",
      "position": "Développeur web en contrat d'apprentissage",
      "summary": "Intervention au sein du centre de service d'Astek Lyon pour différents clients tels que Bureau Veritas ou Fedex.",
      "url": "https://astekgroup.fr/",
      "startDate": "2015",
      "endDate": "2017",
      "highlights": [
        "Equipe : Entre 2 et 5 membres en fonction des projets",
        "Développement des fonctionnalités et mise en place des solutions techniques",
        "Développement de tests unitaires",
        "Participation aux campagnes de tests",
        "Analyse et rédaction de chiffrages pour le client",
        "Technologies utilisées : AngularJS · Spring · Java"
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Ynov Lyon",
      "url": "https://www.ynov.com/campus/lyon/",
      "area": "Développement",
      "studyType": "Expert En Dév. Web - RNCP 1",
      "startDate": "2015",
      "endDate": "2017",
      "courses": []
    },
    {
      "institution": "Université lyon 1",
      "url": "https://www.univ-lyon1.fr/",
      "area": "Informatique Informatique",
      "studyType": "Licence Informatique",
      "startDate": "2014",
      "endDate": "2015",
      "courses": []
    },
    {
      "institution": "IUT informatique lyon 1",
      "url": "https://iut.univ-lyon1.fr/",
      "area": "Informatique",
      "studyType": "DUT Informatique",
      "startDate": "2012",
      "endDate": "2014",
      "courses": []
    }
  ],
  "awards": [],
  "certificates": [],
  "publications": [],
  "skills": [
    {
      "name": "Angular",
      "level": "Expert",
      "keywords": []
    },
    {
      "name": "NGRX",
      "level": "Expert",
      "keywords": []
    },
    {
      "name": "Redux",
      "keywords": []
    },
    {
      "name": "Nestjs",
      "keywords": []
    },
    {
      "name": "GraphQL",
      "keywords": []
    },
    {
      "name": "Nx",
      "keywords": []
    },
    {
      "name": "TypeScript",
      "keywords": []
    },
    {
      "name": "Clean architecture",
      "keywords": []
    },
    {
      "name": "Tailwind",
      "keywords": []
    },
    {
      "name": "PrimeNG",
      "keywords": []
    },
    {
      "name": "Spring boot",
      "keywords": []
    },
    {
      "name": "MongoDB",
      "keywords": []
    },
    {
      "name": "MariaDB",
      "keywords": []
    },
    {
      "name": "Elastic Search",
      "keywords": []
    },
    {
      "name": "Gitlab CI/CD",
      "keywords": []
    },
    {
      "name": "Sonar",
      "keywords": []
    },
    {
      "name": "Docker",
      "keywords": []
    }
  ],
  "languages": [
    {
      "language": "Français",
      "fluency": "Langue natale"
    },
    {
      "language": "Anglais",
      "fluency": "Avancé"
    }
  ],
  "interests": [],
  "projects": []
}